#+title: Rest

** DONE Register TOKEN
Same as [[Register]], But get the token only.

#+name: register_token
#+begin_src restclient :results value :post filter_token(json=*this*)
POST http://localhost:3000/auth/register
Content-Type: application/json

{"username": "username", "password": "password"}
#+end_src

#+RESULTS: register_token
eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiI2NTE0MjVmNjkzOWYwN2VkNWNmOGRkNTYiLCJpYXQiOjE2OTU4MTkyNTQsImV4cCI6MTY5NTgyMjg1NH0.whAjuENnEwE837sI9J04G-CEI-bKCKJePmbyR0ygY4w

** DONE Login TOKEN
#+name: login
#+begin_src restclient :results replace value :post filter_token(json=*this*) :cache no
POST http://localhost:3000/auth/login
Content-Type: application/json

{"username": "username", "password": "password"}

#+end_src

#+RESULTS[54112f04051b2511fe5176cf436107ebccf85157]: login
eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzdWIiOiI2NTFmNTE3OGFiZGI0ODI2ZmU5YWU5YmQiLCJpYXQiOjE2OTY3ODEzODgsImV4cCI6MTY5Njc4NDk4OH0.vUMdHOJA4ArzKup3sAloZxHTC3bsXnPsSgO4Om7BTf4




